sudoku.org
#+STARTUP: inlineimages
#+LANGUAGE: fr
#+LATEX_HEADER: \usepackage[AUTO]{babel}
#+LaTeX_HEADER: \usepackage[x11names]{xcolor}
#+LaTeX_HEADER: \hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = black}
#+LATEX_HEADER: \usepackage[left=1cm,right=1cm,top=2cm,bottom=2cm]{geometry}
#+TITLE: Diplôme Inter-Universitaire
#+SUBTITLE: Projet Sudoku
#+AUTHOR: Raoul HATTERER & Jean-Luc COSSALTER 
#+OPTIONS: toc:1

* Choix du niveau
  | niveau   | restant | pourcentage | minimum |
  |----------+---------+-------------+---------|
  | Beginner |      24 |          30 |       1 |
  | Easy     |      37 |          46 |       2 |
  | Medium   |      46 |          57 |       3 |
  | Hard     |      52 |          64 |       4 |
  | Extreme  |      57 |          70 |       5 |
  |----------+---------+-------------+---------|
  #+TBLFM: $3=round(100*$2/81) 

  - restant : numéros restant à placer (sur 81)
  - minimum : nombre minimum de numéros pour compléter les blocs de 9 numéros (ligne, colonne ou carré)

