sudoku.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2019-04-28 dim. 00:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Diplôme Inter-Universitaire</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Raoul HATTERER &amp; Jean-Luc COSSALTER" />
</head>
<body>
<div id="content">
<h1 class="title">Diplôme Inter-Universitaire
<br />
<span class="subtitle">Projet Sudoku</span>
</h1>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgca638aa">1. Choix du niveau</a></li>
<li><a href="#orgd2fff90">2. Sacs de chiffres restant à placer.</a></li>
<li><a href="#org534b653">3. Cases et grille</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgca638aa" class="outline-2">
<h2 id="orgca638aa"><span class="section-number-2">1</span> Choix du niveau</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">niveau</th>
<th scope="col" class="org-right">restant</th>
<th scope="col" class="org-right">pourcentage</th>
<th scope="col" class="org-right">minimum</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Beginner</td>
<td class="org-right">24</td>
<td class="org-right">30</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Easy</td>
<td class="org-right">37</td>
<td class="org-right">46</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">Medium</td>
<td class="org-right">46</td>
<td class="org-right">57</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">Hard</td>
<td class="org-right">52</td>
<td class="org-right">64</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">Extreme</td>
<td class="org-right">57</td>
<td class="org-right">70</td>
<td class="org-right">5</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>restant : numéros restant à placer (sur 81)</li>
<li>minimum : nombre minimum de numéros pour compléter les blocs de 9 numéros (ligne, colonne ou carré)</li>
</ul>
</div>
</div>
